{
  "items": [
    {
      "team": "Team Automate",
      "organization": "Bench Accounting",
      "description": "Built AI chatbot enabling customers to self-serve ledger categorization. Achieved 50% cutomer engagement and 98% accuracy on categorized transactions."
    },
    {
      "team": "Team Automate",
      "organization": "Bench Accounting",
      "description": "Automated ledger catgeorization of 30% of remaining monthly uncategorized transactions by deploying per-client ML models."
    },
    {
      "team": "Team Automate",
      "organization": "Bench Accounting",
      "description": "Earned Bench's Impact Award, celebrating \"outstanding performance\" and making \" huge impact toward achieving our mission\"."
    },
    {
      "team": "Team Initialize",
      "organization": "Bench Accounting",
      "description": "Increased Plaid connection opt-in rate by 30% by creating a new user onboarding experience."
    },
    {
      "team": "Training and Development",
      "organization": "Bench Accounting",
      "description": "Created communication training program for bookkeepers that outperformed on learner-reported quality metrics by 24%."
    },
    {
      "team": "Founding team",
      "organization": "Survival Academy, UAE",
      "description": "Launced a new survival school in Ras al Khaimah in collaboration with the government tourism authority."
    },
    {
      "team": "Founding team",
      "organization": "Survival Academy, UAE",
      "description": "Planned, bolted, and provided first-year instruction for at-height elements and overnight programs."
    },
    {
      "organization": "Institute of Outdoor Learning",
      "description": "Earned the Accredited Practitioner status and Professional in Outdoor Learning designation."
    },
    {
      "organization": "Mountain Training Association",
      "description": "Awarded with the Mountain Leader and Rock Climbing Instructor qualifications 10 years below the average award earner age."
    }
  ]
}
