{
  "items": [
    {
      "team": "Team Automate",
      "organization": "Bench Accounting",
      "description": "Solely responsible for designing and implementing a backend service that enriches transactions with merchant details using LLMs and a retrieval-augmented generations architecture. By surfacing this information in our internal tools using micro-frontends, saved each human specialist 2.4 hours/day of work and, as a result, around $14,500 per month."
    },
    {
      "team": "Team Automate",
      "organization": "Bench Accounting",
      "description": "Developed LLM-based categorization assistant to guide customers through categorizing according to tax rules, which auto-categorized 230,000 transactions using customer conversations within 3 months, equivalent to ~30,000 months of human bookkeeping or 37% of the work done by specialized human teams in the same period."
    },
    {
      "team": "Team Automate",
      "organization": "Bench Accounting",
      "description": "Wrote a Python backend using Lambda, API Gateway, and React micro-frontends to surface groups of similar uncategorized transactions to customers, enabling them to auto-categorize in groups. This feature increased the manual categorization rate by 55% upon deployment, saving the business the equivalent of ~110 workdays per month in manual human bookkeeping and $22,600 per month."
    },
    {
      "team": "Team Automate",
      "organization": "Bench Accounting",
      "description": "Trained and deployed per-client models to categorize transactions that other categorization models cannot recognize. Raised the auto-categorization rate by 30%, with 98% accuracy, saving the business ~53 days of work per month previously performed by human bookkeepers within two months, equivalent to a cost saving of $10,500 monthly."
    },
    {
      "team": "Team Automate",
      "organization": "Bench Accounting",
      "description": "Earned Bench's Impact Award, celebrating \"outstanding performance\" and making a \"huge impact toward achieving our mission\"."
    },
    {
      "team": "Team Initialize",
      "organization": "Bench Accounting",
      "description": "Streamlined sign-up and onboarding funnel, resulting in a 56% increase in new customers opting into Plaid integrations. Found opportunities to perform client GraphQL queries 64% faster, saving 1500ms from LCP in our onboarding flow."
    },
    {
      "team": "Team Initialize",
      "organization": "Bench Accounting",
      "description": "Contributed to overhauling the client app using React.js, delivering improved performance, better accessibility practices, and a better UX to 25,000+ customers. "
    },
    {
      "team": "Team Initialize",
      "organization": "Bench Accounting",
      "description": "Implemented a redesign of the customer cancellation flow, reducing churn rate by 18% in our first month and saving ~$17,000 per month."
    },
    {
      "team": "Solo maker",
      "organization": "cohabit.homes",
      "description": "Built application making it easy to plan, manage, and execute a professional home cleaning list."
    },
    {
      "team": "Training Team",
      "organization": "Bench Accounting",
      "description": "Created a communication training program for bookkeepers that outperformed learner-reported quality metrics by 24%."
    },
    {
      "organization": "Various organizations",
      "description": "Lived in and led outdoor mountain trekking, canoeing, and climbing programs for youth on five continents."
    },
    {
      "team": "Founding team",
      "organization": "Survival Academy, UAE",
      "description": "Launched a new survival school in Ras al Khaimah in collaboration with the government tourism authority."
    },
    {
      "team": "Founding team",
      "organization": "Survival Academy, UAE",
      "description": "Planned, bolted, and provided first-year instruction for at-height elements and overnight programs."
    },
    {
      "team": "Wilderness Program Department",
      "organization": "YMCA-YWCA of Winnipeg",
      "description": "Managed a team of 20, overseeing complex logistics of 30 deep-wilderness programs covering over 100 weeks of outdoor tripping."
    },
    {
      "team": "Founding instructor team",
      "organization": "Zeal Adventure",
      "description": "Involved in building a new adventure travel company during its first three years of operation. Learned a lot from the businesses failure."
    },
    {
      "organization": "Institute of Outdoor Learning",
      "description": "Earned the Accredited Practitioner status and Professional in Outdoor Learning designation."
    },
    {
      "organization": "Mountain Training Association",
      "description": "Awarded the Mountain Leader and Rock Climbing Instructor qualifications 10 years below the average award earner age."
    },
    {
      "organization": "Department of Education",
      "description": "Qualified as a teacher in the UK with a first-class PGDE."
    }
  ]
}
