{
  "items": [
    {
      "team": "Team Automate",
      "organization": "Bench Accounting",
      "description": "Built AI chatbot enabling customers to self-serve ledger categorization. Achieved 50% customer engagement and 98% accuracy on categorized transactions."
    },
    {
      "team": "Team Automate",
      "organization": "Bench Accounting",
      "description": "Automated ledger categorization of 30% of remaining monthly uncategorized transactions by deploying per-client ML models."
    },
    {
      "team": "Team Automate",
      "organization": "Bench Accounting",
      "description": "Earned Bench's Impact Award, celebrating \"outstanding performance\" and making a \"huge impact toward achieving our mission\"."
    },
    {
      "team": "Team Initialize",
      "organization": "Bench Accounting",
      "description": "Streamlined Plaid sign-up funnel, resulting in a 56% increase in new customers opting-in to real-time transactions."
    },
    {
      "team": "Team Initialize",
      "organization": "Bench Accounting",
      "description": "Created a workflow management tool in under a month, enabling our operations department to transition to decentralized teams."
    },
    {
      "team": "Solo maker",
      "organization": "cohabit.homes",
      "description": "Built application making it easy to plan, manage, and execute a professional home cleaning list."
    },
    {
      "team": "Training Team",
      "organization": "Bench Accounting",
      "description": "Created a communication training program for bookkeepers that outperformed learner-reported quality metrics by 24%."
    },
    {
      "organization": "Various organizations",
      "description": "Lived in and led outdoor mountain trekking, canoeing, and climbing programs for youth on five continents."
    },
    {
      "team": "Founding team",
      "organization": "Survival Academy, UAE",
      "description": "Launched a new survival school in Ras al Khaimah in collaboration with the government tourism authority."
    },
    {
      "team": "Founding team",
      "organization": "Survival Academy, UAE",
      "description": "Planned, bolted, and provided first-year instruction for at-height elements and overnight programs."
    },
    {
      "team": "Wilderness Program Department",
      "organization": "YMCA-YWCA of Winnipeg",
      "description": "Managed a team of 20, overseeing complex logistics of 30 deep-wilderness programs covering over 100 weeks of outdoor tripping."
    },
    {
      "team": "Founding instructor team",
      "organization": "Zeal Adventure",
      "description": "Involved in building a new adventure travel company during its first three years of operation. Learned a lot from the businesses failure."
    },
    {
      "organization": "Institute of Outdoor Learning",
      "description": "Earned the Accredited Practitioner status and Professional in Outdoor Learning designation."
    },
    {
      "organization": "Mountain Training Association",
      "description": "Awarded the Mountain Leader and Rock Climbing Instructor qualifications 10 years below the average award earner age."
    },
    {
      "organization": "Department of Education",
      "description": "Qualified as a teacher in the UK with a first-class PGDE."
    }
  ]
}
